Repository: stanercelik/PolySleep
Catalog: polynap/Resources/Localizations/History/AddSleepEntrySheet.xcstrings
Source language: en
Languages: de, ja, ms, th, tr

source: Add Sleep Entry
de: Schlafeintrag hinzufügen
ja: 睡眠の記録を追加
ms: Tambah Catatan Tidur
th: เพิ่มรายการการนอนหลับ
tr: Yeni Uyku Kaydı Ekle

# general.cancel
source: Cancel
de: Abbrechen
ja: キャンセル
ms: Batal
th: ยกเลิก
tr: İptal

# general.save
source: Save
de: Speichern
ja: 保存
ms: Simpan
th: บันทึก
tr: Kaydet

# sleep.quality.bad
source: Bad sleep
de: Schlechter Schlaf
ja: イマイチな睡眠
ms: Tidur yang teruk
th: การนอนหลับไม่ดี
tr: Kötü uyku

# sleep.quality.good
source: Good sleep
de: Guter Schlaf
ja: 良い睡眠
ms: Tidur yang baik
th: การนอนหลับที่ดี
tr: İyi uyku

# sleep.quality.neutral
source: Neutral sleep
de: Neutraler Schlaf
ja: 普通の睡眠
ms: Tidur neutral
th: การนอนหลับปานกลาง
tr: Orta karar

# sleep.quality.okay
source: Okay sleep
de: Okay-Schlaf
ja: まあまあな睡眠
ms: Tidur yang OK
th: การนอนหลับพอใช้
tr: Fena değil

# sleep.quality.veryBad
source: Very bad sleep
de: Sehr schlechter Schlaf
ja: 最悪の睡眠
ms: Tidur yang sangat teruk
th: การนอนหลับแย่มาก
tr: Berbat uyku

# sleep.quality.veryGood
source: Very good sleep
de: Sehr guter Schlaf
ja: 最高の睡眠
ms: Tidur yang sangat baik
th: การนอนหลับดีมาก
tr: Çok iyi uyku

# sleepBlock.type.core
source: Core
de: Kern
ja: コア
ms: Teras
th: การนอนหลัก
tr: Ana

# sleepBlock.type.nap
source: Nap
de: Nickerchen
ja: 仮眠
ms: Tidur Sebentar
th: งีบ
tr: Şekerleme

# sleepEntry.add
source: Add Sleep Entry
de: Schlafeintrag hinzufügen
ja: 睡眠を記録
ms: Tambah Catatan Tidur
th: เพิ่มรายการการนอนหลับ
tr: Uyku Kaydı Ekle

# sleepEntry.date
source: Date
de: Datum
ja: 日付
ms: Tarikh
th: วันที่
tr: Tarih

# sleepEntry.dateInfo
source: You can only add entries for today or past dates
de: Du kannst nur Einträge für heute oder vergangene Daten hinzufügen
ja: 記録できるのは今日か過去の日付だけだよ
ms: Anda hanya boleh menambah catatan untuk hari ini atau tarikh yang lalu
th: คุณสามารถเพิ่มรายการสำหรับวันนี้หรือวันที่ผ่านมาเท่านั้น
tr: Sadece bugün veya geçmiş tarihler için kayıt ekleyebilirsin

# sleepEntry.error.alreadyAdded
source: This block is already added for the selected date.
de: Dieser Block wurde bereits für das ausgewählte Datum hinzugefügt.
ja: このブロックはもう追加されてるよ
ms: Blok ini telah ditambahkan untuk tarikh yang dipilih.
th: ช่วงการนอนนี้ถูกเพิ่มสำหรับวันที่เลือกแล้ว
tr: Bu blok seçili tarih için zaten eklenmiş.

# sleepEntry.error.futureDate
source: You cannot add sleep entries for future dates. Please select today or a past date.
de: Du kannst keine Schlafeinträge für zukünftige Daten hinzufügen. Bitte wähle heute oder ein vergangenes Datum.
ja: 未来の日付には記録できないよ。今日か過去の日付を選んでね。
ms: Anda tidak boleh menambah catatan tidur untuk tarikh akan datang. Sila pilih hari ini atau tarikh yang lalu.
th: คุณไม่สามารถเพิ่มรายการการนอนหลับสำหรับวันในอนาคตได้ โปรดเลือกวันนี้หรือวันที่ผ่านมา
tr: Gelecekteki tarihler için uyku kaydı ekleyemezsin. Lütfen bugün veya geçmiş bir tarih seç.

# sleepEntry.error.notFinished
source: This sleep block has not finished yet. You can only add entries for completed sleep blocks.
de: Dieser Schlafblock ist noch nicht beendet. Du kannst nur Einträge für abgeschlossene Schlafblöcke hinzufügen.
ja: この睡眠はまだ終わってないよ。終わった睡眠だけ記録できるんだ。
ms: Blok tidur ini belum selesai. Anda hanya boleh menambah catatan untuk blok tidur yang telah selesai.
th: ช่วงการนอนนี้ยังไม่สิ้นสุด คุณสามารถเพิ่มรายการสำหรับช่วงการนอนหลับที่เสร็จสมบูรณ์แล้วเท่านั้น
tr: Bu uyku bloğu henüz bitmedi. Sadece tamamlanmış uyku blokları için kayıt ekleyebilirsin.

# sleepEntry.error.title
source: Sleep Entry Error
de: Fehler beim Schlafeintrag
ja: 記録エラー
ms: Ralat Catatan Tidur
th: ข้อผิดพลาดในการเพิ่มรายการการนอนหลับ
tr: Uyku Kaydı Hatası

# sleepEntry.howDidYouFeel
source: How did you feel?
de: Wie hast du dich gefühlt?
ja: どんな感じだった？
ms: Bagaimana perasaan anda?
th: คุณรู้สึกอย่างไร?
tr: Nasıl hissettin?

# sleepEntry.noBlocks
source: No available blocks
de: Keine verfügbaren Blöcke
ja: 記録できるブロックがないね
ms: Tiada blok tersedia
th: ไม่มีช่วงการนอนที่ใช้ได้
tr: Mevcut blok yok

# sleepEntry.quality
source: Sleep Quality
de: Schlafqualität
ja: 睡眠の質
ms: Kualiti Tidur
th: คุณภาพการนอนหลับ
tr: Uyku Kalitesi

# sleepEntry.quality.bad
source: Bad
de: Schlecht
ja: イマイチ
ms: Teruk
th: ไม่ดี
tr: Kötü

# sleepEntry.quality.excellent
source: Excellent
de: Ausgezeichnet
ja: 最高！
ms: Cemerlang
th: ยอดเยี่ยม
tr: Mükemmel

# sleepEntry.rating
source: Sleep Rating
de: Schlafbewertung
ja: 睡眠スコア
ms: Penilaian Tidur
th: การให้คะแนนการนอนหลับ
tr: Uyku Puanı

# sleepEntry.selectBlock
source: Select Sleep Block
de: Schlafblock auswählen
ja: ブロックを選択
ms: Pilih Blok Tidur
th: เลือกช่วงการนอนหลับ
tr: Uyku Bloğu Seç

# sleepEntry.selectDate
source: Select Date
de: Datum auswählen
ja: 日付を選択
ms: Pilih Tarikh
th: เลือกวันที่
tr: Tarih Seç

# sleepModification.statusTitle
source: Sleep Status
de: Schlafstatus
ja: 睡眠のステータス
ms: Status Tidur
th: สถานะการนอนหลับ
tr: Uyku Durumu

# sleepModification.asScheduled
source: As Scheduled
de: Wie geplant
ja: 予定通り
ms: Seperti yang Dijadualkan
th: ตามกำหนด
tr: Planlandığı Gibi

# sleepModification.adjusted
source: Adjust Time
de: Zeit anpassen
ja: 時間を調整
ms: Laraskan Masa
th: ปรับเวลา
tr: Zamanı Ayarla

# sleepModification.skipped
source: Skipped
de: Übersprungen
ja: スキップ
ms: Dilangkau
th: ข้าม
tr: Atlandı

# sleepModification.startTime
source: Start Time
de: Startzeit
ja: 開始時間
ms: Masa Mula
th: เวลาเริ่มต้น
tr: Başlangıç Saati

# sleepModification.endTime
source: End Time
de: Endzeit
ja: 終了時間
ms: Masa Tamat
th: เวลาสิ้นสุด
tr: Bitiş Saati

# sleepEntry.noBlocks.suggestion
source: Create a sleep schedule first to add entries.
de: Erstelle zuerst einen Schlafplan, um Einträge hinzuzufügen.
ja: 記録を追加するには、まず睡眠スケジュールを作成してください。
ms: Buat jadual tidur terlebih dahulu untuk menambah entri.
th: สร้างตารางการนอนหลับก่อนเพื่อเพิ่มรายการ
tr: Giriş eklemek için önce bir uyku programı oluşturun.

# sleepModification.durationTitle
source: Sleep Duration
de: Schlafdauer
ja: 睡眠時間
ms: Tempoh Tidur
th: ระยะเวลาการนอนหลับ
tr: Uyku Süresi

# sleepModification.scheduled
source: Scheduled
de: Geplant
ja: 予定
ms: Dijadualkan
th: ตามกำหนด
tr: Planlanan

# sleepModification.actual
source: Actual
de: Tatsächlich
ja: 実際
ms: Sebenar
th: จริง
tr: Gerçek

# sleepModification.fullDuration
source: Full duration
de: Vollständige Dauer
ja: 全て
ms: Tempoh penuh
th: ระยะเวลาเต็ม
tr: Tam süre

# sleepModification.didntSleep
source: Didn't sleep
de: Nicht geschlafen
ja: 寝なかった
ms: Tidak tidur
th: ไม่ได้นอน
tr: Uyumadım

# sleepModification.early5
source: 5min early
de: 5min früher
ja: 5分早い
ms: 5min awal
th: เร็ว 5 นาที
tr: 5dk erken

# sleepModification.wokeEarly
source: Woke early
de: Früh aufgewacht
ja: 早く起きた
ms: Bangun awal
th: ตื่นเร็ว
tr: Erken uyandım

# sleepModification.late10
source: 10min late
de: 10min länger
ja: 10分長い
ms: 10min lewat
th: นาน 10 นาที
tr: 10dk geç

# sleepModification.sleptLonger
source: Slept longer
de: Länger geschlafen
ja: 長く寝た
ms: Tidur lebih lama
th: นอนนานกว่า
tr: Daha uzun uyudum

# sleepModification.customAdjustment
source: Custom adjustment
de: Benutzerdefinierte Anpassung
ja: カスタム調整
ms: Pelarasan tersuai
th: ปรับแต่งเอง
tr: Özel ayarlama

# sleepModification.customTimes
source: Custom Times
de: Benutzerdefinierte Zeiten
ja: カスタム時間
ms: Masa Tersuai
th: เวลาที่กำหนดเอง
tr: Özel Saatler

# sleepModification.applyCustom
source: Apply Duration
de: Anpassen
ja: 適用
ms: Gunakan
th: ใช้ระยะเวลา
tr: Süreyi Uygula

# sleepModification.earlyWake
source: Woke %d min early
de: %d Min früher aufgewacht
ja: %d分早く起きた
ms: Bangun %d min awal
th: ตื่นเร็ว %d นาที
tr: %d dk erken uyandım

# sleepModification.sleptLate
source: Slept %d min longer
de: %d Min länger geschlafen
ja: %d分長く寝た
ms: Tidur %d min lebih lama
th: นอนนาน %d นาที
tr: %d dk daha uzun uyudum

# sleepModification.customTime
source: Custom time
de: Benutzerdefinierte Zeit
ja: カスタム時間
ms: Masa tersuai
th: เวลาที่กำหนดเอง
tr: Özel saat

# sleepModification.differentTime
source: Different Time
de: Andere Zeit
ja: 異なる時間
ms: Masa Berbeza
th: เวลาที่แตกต่าง
tr: Farklı Süre

# sleepModification.adjustDuration
source: Adjust Duration
de: Dauer anpassen
ja: 時間を調整
ms: Sesuaikan Tempoh
th: ปรับระยะเวลา
tr: Süreyi Ayarla

# sleepModification.adjustDurationDescription
source: Slide to adjust your actual sleep duration
de: Schieben Sie den Regler, um Ihre tatsächliche Schlafdauer anzupassen
ja: スライダーで実際の睡眠時間を調整してください
ms: Luncurkan untuk menyesuaikan tempoh tidur sebenar anda
th: เลื่อนเพื่อปรับระยะเวลาการนอนหลับจริงของคุณ
tr: Gerçek uyku sürenizi ayarlamak için kaydırın

# sleepModification.sleptShorter
source: Slept %d min shorter
de: %d Min kürzer geschlafen
ja: %d分短く寝た
ms: Tidur %d min lebih pendek
th: นอนสั้นลง %d นาที
tr: %d dk daha kısa uyudu

# sleepModification.customTimeDescription
source: Set your own start and end times
de: Eigene Start- und Endzeiten festlegen
ja: 独自の開始時間と終了時間を設定
ms: Tetapkan masa mula dan tamat sendiri
th: กำหนดเวลาเริ่มต้นและสิ้นสุดของคุณเอง
tr: Kendi başlangıç ve bitiş saatlerini belirle

# general.ok
source: OK
th: ตกลง
tr: Tamam
